export const victorinaData = [
  {
    question: "Что такое Python?",
    answers: [
      "Открытый  исходный код для  создания  веб-сайтов",
      "Змея",
      "Язык программирования",
      "Приложение",
    ],
    correctAnswer: 3,
  },
  {
    question:
      "Какой тип данных используется для хранения целых чисел в Python?",
    answers: ["float", "int", "str", "bool"],
    correctAnswer: 2,
  },
  {
    question: "Как создать комментарий  в Python?",
    answers: ["// Comment", "/* Comment */", "# Comment", "-- Comment"],
    correctAnswer: 3,
  },
  {
    question: "Как вывести текст на экран в Python?",
    answers: ["echo ()", "print()", "display ()", "show()"],
    correctAnswer: 2,
  },
  {
    question: "Как  объединить два списка в Python?",
    answers: ["merge() ", "combine()", "concatenate()", "join()"],
    correctAnswer: 3,
  },
  {
    question: "Какие скобки используются  для создания кортежа?",
    answers: ["()", "{}", "[]", "<>"],
    correctAnswer: 1,
  },
  {
    question: "Как проверить, присутствует ли элемент в списке?",
    answers: ["chek()", "find()", "exists()", "in"],
    correctAnswer: 4,
  },
  {
    question:
      "Какие кавычки используются для создания многострочной строки в Python?",
    answers: ["“”", "’’", "’’’ ‘’’", "“““ ”””"],
    correctAnswer: 3,
  },
  {
    question: "Что делает оператор if B Python?",
    answers: [
      "Создает цикл",
      "Выполняет код, если условие истинно",
      "Устанавливает новое значение переменной",
      "Меняет переменную",
    ],
    correctAnswer: 2,
  },
  {
    question: "Какой оператор используется для проверки равенства значений?",
    answers: ["==", "=", "===", "is_equal()"],
    correctAnswer: 1,
  },
  {
    question: "Что такое django?",
    answers: ["Язык программирования", "Приложение", "Сайт", "Фреймворк"],
    correctAnswer: 4,
  },
  {
    question: "На каком языке написан django?",
    answers: ["c#", "c++", "js", "Python"],
    correctAnswer: 4,
  },
  {
    question: "Главная функция информатики?",
    answers: [
      "разработка методов и средств преобразования информации и их использование в организации технологического процесса переработки информации.",
      "исследование информационных процессов любой природы.",
      "разработка информационной техники и создание новейшей технологии переработки информации на базе полученных результатов исследования информационных процессов.",
      "решение научных и инженерных проблем создания, внедрения и обеспечения эффективного использования компьютерной техники и технологии во всех сферах общественной жизни.",
    ],
    correctAnswer: 1,
  },
  {
    question: "Виды информации по способу восприятия информации человеком:",
    answers: [
      "визуальная, звуковая, тактильная, обонятельная, вкусовая",
      "математическая, биологическая, медицинская, психологическая",
      "обыденная, производственная, техническая, управленческая",
      "текстовая, числовая, графическая, табличная",
    ],
    correctAnswer: 1,
  },
  {
    question: "Слово длиной из 8 бит называется…",
    answers: ["байтом", "стандартом", "адресом", "дитом"],
    correctAnswer: 1,
  },
];

export const answerColors = ["#F00", "#0029FF", "#FFE600", "#2D9F11"];
